Catalogs/упНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упНормыРасходаГСМ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИзменениеРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расход</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходОтопитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНормыРасходаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыНормРасходаГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипНормы</Name>
					<Comment>Истина - на 100 км пробега, Ложь - на 1 час работы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаТемпературныхКоэффициентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упОценочнаяШкала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаЗимний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходЗимний</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаГорнаяМестность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходГорнаяМестность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаСложностьДорог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходСложностьДорог</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаНаселенныйПункт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходНаселенныйПункт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаГрузовой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходГрузовой</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаКондиционер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходКондиционер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаКлиматКонтроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходКлиматКонтроль</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаОтопитель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаДлительнаяЭксплуатация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходДлительнаяЭксплуатация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаСпециальноеОборудование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходСпециальноеОборудование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаПростой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходПростой</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьТемпературуВоздухаВПутевомЛисте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходРабочаяОперация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасходаРабочаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчетаНадбавокГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипыНормРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыНормРасходаГСМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСтоКилометров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОдинЧасРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упНормыРасходаГСМ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	сткНадписи = СтруктураНадписейНорм(Объект.ТипНормыРасходаГСМ);
	НадписьИзменениеРасхода = сткНадписи.ИзменениеРасхода;
	НадписьРасход		    = сткНадписи.Расход;
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипНормыПриИзменении(Элемент)
	
	сткНадписи = СтруктураНадписейНорм(Объект.ТипНормыРасходаГСМ);
	НадписьИзменениеРасхода = сткНадписи.ИзменениеРасхода;
	НадписьРасход		    = сткНадписи.Расход;

	Если Объект.ТипНормыРасходаГСМ = ПредопределенноеЗначение("Перечисление.упТипыНормРасходаГСМ.НаОдинЧасРаботы") Тогда
		Объект.ИзменениеРасхода = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаРасчетаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ФормулаРасчета) Тогда
		Объект.ШкалаТемпературныхКоэффициентов = ПредопределенноеЗначение("Справочник.упОценочнаяШкала.ПустаяСсылка");
		Элементы.ШкалаТемпературныхКоэффициентов.Доступность = Ложь;
		Элементы.ШкалаТемпературныхКоэффициентов.ПодсказкаВвода = Нстр("ru = 'Шкала задается в формуле расчета'");
	Иначе
		Элементы.ШкалаТемпературныхКоэффициентов.ПодсказкаВвода = "";
		Элементы.ШкалаТемпературныхКоэффициентов.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураНадписейНорм(ТипНормыРасходаГСМ)
	
	сткРезультат = Новый Структура("Расход, ИзменениеРасхода","","");
	
	сткРезультат.Расход = СтрШаблон("(%1)", ТипНормыРасходаГСМ);
	
	Если ТипНормыРасходаГСМ = ПредопределенноеЗначение("Перечисление.упТипыНормРасходаГСМ.НаСтоКилометров") Тогда
		сткРезультат.ИзменениеРасхода = Нстр("ru = '(на 100 тонно-километров)'");
	КонецЕсли;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти
